In [ ]:
#outlier : data mistake or error

In [ ]:
#difference between 0 and missing value

In [ ]:
#missing value that has a meaning = 'I don't want to answer'-- here NA is 'does'nt want to answer is meaningful for data interpretation

In [ ]:
missing value bec nit asked for, someoen did dnot collect it= input it, othewise you would have to get rid of the whole country

# Handling duplicates

In [2]:
import pandas as pd

In [12]:
df = pd.read_csv('titanic.csvr', sep=';')

In [13]:
df.drop_duplicates()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
len(df)

485

In [10]:
len(df.drop_duplicates())

483

In [ ]:
 len(df.drop_duplicates(subset='Name')) #to search for duplicates in a specific row

In [ ]:
df_additional = pd.DataFrame([{'Name':'Dooley, Mr Patrick'},{'Name':'Dooley, Mr Patrick'}]) #add values in a column

In [ ]:
df_dup = pd.concat([df, df_additional])

In [ ]:
dp_dup.duplicated(subset=['Name'])

In [ ]:
 len(df.drop_duplicates(subset=['Name'], keep='first') #you would either keep first or lzst if you are deleting other values. #or keep=last

# Regular expressions

In [ ]:
df.['Name'].replace(r'(.*)') #r': always put a r
df.['Name'].match
df.['Name'].extract

In [20]:
df['Name'].replace(r'(.*),','#', regex=False)

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [25]:
df['Name'].str.split(" ").str[0:2].str.join(' ')

0           Braund, Mr.
1         Cumings, Mrs.
2      Heikkinen, Miss.
3        Futrelle, Mrs.
4            Allen, Mr.
             ...
886      Montvila, Rev.
887       Graham, Miss.
888     Johnston, Miss.
889           Behr, Mr.
890         Dooley, Mr.
Name: Name, Length: 891, dtype: object

In [ ]:
#apply in pandas == map function python
#map in pd is sth else: they work on series (contentof a column)

In [27]:
##only use apply for something not possible in pandas

df['Name'].apply(lambda s: s.split(','))

0                             [Braund,  Mr. Owen Harris]
1      [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                              [Heikkinen,  Miss. Laina]
3        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                            [Allen,  Mr. William Henry]
                             ...
886                             [Montvila,  Rev. Juozas]
887                      [Graham,  Miss. Margaret Edith]
888          [Johnston,  Miss. Catherine Helen "Carrie"]
889                             [Behr,  Mr. Karl Howell]
890                               [Dooley,  Mr. Patrick]
Name: Name, Length: 891, dtype: object

In [ ]:
%%time #if code becomes slow

In [ ]:
def split_string(s):
    return s.split

In [28]:
df['Sex'].map({'male': 'M', 'female':'F'})

0      M
1      F
2      F
3      F
4      M
      ..
886    M
887    F
888    F
889    M
890    M
Name: Sex, Length: 891, dtype: object

In [30]:
import numpy as np

In [31]:
df.loc[df["Age"].isna(), "Age"] = df['Age'].mean()

In [32]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

In [ ]:
from sklearn.impute import SimpleImputer, KNNImputer
import pandas as pd

In [34]:
imputer = SimpleImputer(strategy='mean')

In [ ]:
df["Cabin"] =

In [ ]:
KNN = all other column s

In [ ]:
#irrelevant data won't be relevant in the matrix anyways

In [35]:
##Change type of column
df.Pclass.astype(str)

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: object

In [36]:
##To do the inverse, we should do 'get dummies'
pd.get_dummies(df['Embarked'])

     C  Q  S
0    0  0  1
1    1  0  0
2    0  0  1
3    0  0  1
4    0  0  1
..  .. .. ..
886  0  0  1
887  0  0  1
888  0  0  1
889  1  0  0
890  0  1  0

[891 rows x 3 columns]